In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-0.15607518, -0.39056632, -0.49376641],
       [ 1.18329421, -0.67840421,  0.4923816 ],
       [ 0.01787355,  0.53459689, -1.0089015 ],
       [-0.91158134,  1.00405769, -0.98724389]])

In [4]:
dataFrame=pd.DataFrame(data)

In [5]:
type(dataFrame[0])

pandas.core.series.Series

In [6]:
dataFrame

          0         1         2
0 -0.156075 -0.390566 -0.493766
1  1.183294 -0.678404  0.492382
2  0.017874  0.534597 -1.008901
3 -0.911581  1.004058 -0.987244

In [7]:
yeniDataFrame=pd.DataFrame(data,index=["Yakup","Yusuf","Yunus","Ahmet"],columns=["Maas","Yas","Çalışma Saati"])

In [8]:
yeniDataFrame

           Maas       Yas  Çalışma Saati
Yakup -0.156075 -0.390566      -0.493766
Yusuf  1.183294 -0.678404       0.492382
Yunus  0.017874  0.534597      -1.008901
Ahmet -0.911581  1.004058      -0.987244

In [9]:
len(yeniDataFrame)

4

In [10]:
yeniDataFrame["Yas"]

Yakup   -0.390566
Yusuf   -0.678404
Yunus    0.534597
Ahmet    1.004058
Name: Yas, dtype: float64

In [11]:
yeniDataFrame[["Maas","Yas"]]

           Maas       Yas
Yakup -0.156075 -0.390566
Yusuf  1.183294 -0.678404
Yunus  0.017874  0.534597
Ahmet -0.911581  1.004058

In [12]:
yeniDataFrame.loc["Yakup"]

Maas            -0.156075
Yas             -0.390566
Çalışma Saati   -0.493766
Name: Yakup, dtype: float64

In [13]:
yeniDataFrame.iloc[0]

Maas            -0.156075
Yas             -0.390566
Çalışma Saati   -0.493766
Name: Yakup, dtype: float64

In [14]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [15]:
yeniDataFrame

           Maas       Yas  Çalışma Saati  Emeklilik Yasi
Yakup -0.156075 -0.390566      -0.493766       -0.781133
Yusuf  1.183294 -0.678404       0.492382       -1.356808
Yunus  0.017874  0.534597      -1.008901        1.069194
Ahmet -0.911581  1.004058      -0.987244        2.008115

In [16]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1)

           Maas       Yas  Çalışma Saati
Yakup -0.156075 -0.390566      -0.493766
Yusuf  1.183294 -0.678404       0.492382
Yunus  0.017874  0.534597      -1.008901
Ahmet -0.911581  1.004058      -0.987244

In [17]:
yeniDataFrame.drop("Ahmet",axis=0)

           Maas       Yas  Çalışma Saati  Emeklilik Yasi
Yakup -0.156075 -0.390566      -0.493766       -0.781133
Yusuf  1.183294 -0.678404       0.492382       -1.356808
Yunus  0.017874  0.534597      -1.008901        1.069194

In [18]:
yeniDataFrame

           Maas       Yas  Çalışma Saati  Emeklilik Yasi
Yakup -0.156075 -0.390566      -0.493766       -0.781133
Yusuf  1.183294 -0.678404       0.492382       -1.356808
Yunus  0.017874  0.534597      -1.008901        1.069194
Ahmet -0.911581  1.004058      -0.987244        2.008115

In [19]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)

In [20]:
yeniDataFrame

           Maas       Yas  Çalışma Saati
Yakup -0.156075 -0.390566      -0.493766
Yusuf  1.183294 -0.678404       0.492382
Yunus  0.017874  0.534597      -1.008901
Ahmet -0.911581  1.004058      -0.987244

In [21]:
yeniDataFrame.loc["Yakup"]["Yas"]

-0.3905663163812846

In [22]:
yeniDataFrame.loc["Yakup","Maas"]

-0.15607517948717672

In [23]:
yeniDataFrame

           Maas       Yas  Çalışma Saati
Yakup -0.156075 -0.390566      -0.493766
Yusuf  1.183294 -0.678404       0.492382
Yunus  0.017874  0.534597      -1.008901
Ahmet -0.911581  1.004058      -0.987244

In [24]:
booleanFrame = yeniDataFrame < 0

In [25]:
booleanFrame

        Maas    Yas  Çalışma Saati
Yakup   True   True           True
Yusuf  False   True          False
Yunus  False  False           True
Ahmet   True  False           True

In [26]:
yeniDataFrame

           Maas       Yas  Çalışma Saati
Yakup -0.156075 -0.390566      -0.493766
Yusuf  1.183294 -0.678404       0.492382
Yunus  0.017874  0.534597      -1.008901
Ahmet -0.911581  1.004058      -0.987244

In [27]:
yeniDataFrame[booleanFrame]

           Maas       Yas  Çalışma Saati
Yakup -0.156075 -0.390566      -0.493766
Yusuf       NaN -0.678404            NaN
Yunus       NaN       NaN      -1.008901
Ahmet -0.911581       NaN      -0.987244

In [28]:
yeniDataFrame[yeniDataFrame["Yas"]>0]

           Maas       Yas  Çalışma Saati
Yunus  0.017874  0.534597      -1.008901
Ahmet -0.911581  1.004058      -0.987244

In [29]:
yeniDataFrame.reset_index()

   index      Maas       Yas  Çalışma Saati
0  Yakup -0.156075 -0.390566      -0.493766
1  Yusuf  1.183294 -0.678404       0.492382
2  Yunus  0.017874  0.534597      -1.008901
3  Ahmet -0.911581  1.004058      -0.987244

In [30]:
yeniIndexListesi=["Yak","Yus","Yun","Ahm"]

In [31]:
yeniDataFrame["YeniIndexListesi"] = yeniIndexListesi

In [32]:
yeniDataFrame

           Maas       Yas  Çalışma Saati YeniIndexListesi
Yakup -0.156075 -0.390566      -0.493766              Yak
Yusuf  1.183294 -0.678404       0.492382              Yus
Yunus  0.017874  0.534597      -1.008901              Yun
Ahmet -0.911581  1.004058      -0.987244              Ahm

In [33]:
yeniDataFrame.set_index("YeniIndexListesi")

                      Maas       Yas  Çalışma Saati
YeniIndexListesi
Yak              -0.156075 -0.390566      -0.493766
Yus               1.183294 -0.678404       0.492382
Yun               0.017874  0.534597      -1.008901
Ahm              -0.911581  1.004058      -0.987244

In [34]:
yeniDataFrame

           Maas       Yas  Çalışma Saati YeniIndexListesi
Yakup -0.156075 -0.390566      -0.493766              Yak
Yusuf  1.183294 -0.678404       0.492382              Yus
Yunus  0.017874  0.534597      -1.008901              Yun
Ahmet -0.911581  1.004058      -0.987244              Ahm

In [35]:
yeniDataFrame.set_index("YeniIndexListesi",inplace=True)

In [36]:
yeniDataFrame

                      Maas       Yas  Çalışma Saati
YeniIndexListesi
Yak              -0.156075 -0.390566      -0.493766
Yus               1.183294 -0.678404       0.492382
Yun               0.017874  0.534597      -1.008901
Ahm              -0.911581  1.004058      -0.987244

In [37]:
yeniDataFrame.loc["Yak"]

Maas            -0.156075
Yas             -0.390566
Çalışma Saati   -0.493766
Name: Yak, dtype: float64

## Multi Index

In [38]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]

In [39]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [40]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [41]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [42]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [43]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [44]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [45]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [48]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [49]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [50]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [51]:
cizgiFilmDataFrame.loc["South Park"].loc["Kyle"]

Yas       11
Meslek     F
Name: Kyle, dtype: object

In [52]:
cizgiFilmDataFrame.index.names=["Film Adı","İsim"]

In [53]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F